# Week2 Assignment

In [1]:
# Importing necessary libraries

In [2]:
# necessary libraries
import numpy as np
import pandas as pd

#For the use of SQL

#import sqlite3 
#import mysql
#import sqlalchemy

%load_ext sql
import pymysql

In [3]:
#Connecting to the MYSQL server where my database is:

conn=pymysql.connect(host='localhost',port=int(3306),user='root',passwd='Mmatzongmail1!',db='college')  #eureka!

In [4]:
#Read the table from the database from MYSQL:
data=pd.read_sql_query("SELECT * FROM Students ",conn)

print(data)

   id First_Name  Surname  Algebra  Calculus  Programming  Databases_
0   1        Joe     Soap       92        78           65          67
1   2       Jane      Doe       81        79           83          89
2   3       Mary  Poppins       63        52           65          71
3   4      Mario    Rossi       23        42           50          44
4   5       John    Smith       56        67           72          72
5   6        Tom     Cruz       81        62           53          59
6   7        Jim   Beglin       41        48           51          53
7   8      Peter  Shmooks       55        55           66          58
8   9       Hans    Meier       57        87           95          64
9  10     Jackie    Brown       97        91           86          73

In [5]:
Average1 = data[['Algebra','Calculus','Programming','Databases_']].mean(axis=1)
Average=Average1.round(1)
print (Average)

0    75.5
1    83.0
2    62.8
3    39.8
4    66.8
5    63.8
6    48.2
7    58.5
8    75.8
9    86.8
dtype: float64

In [6]:
data['Average']= Average
data.head(6)

   id First_Name  Surname  Algebra  Calculus  Programming  Databases_  Average
0   1        Joe     Soap       92        78           65          67     75.5
1   2       Jane      Doe       81        79           83          89     83.0
2   3       Mary  Poppins       63        52           65          71     62.8
3   4      Mario    Rossi       23        42           50          44     39.8
4   5       John    Smith       56        67           72          72     66.8
5   6        Tom     Cruz       81        62           53          59     63.8

In [7]:
data['Grade'] = np.where(data['Average'] >=80, 'A', 
             np.where((data['Average'] >=70) & (data['Average'] <=79.9 ),'B', 
             np.where((data['Average'] >=60) & (data['Average']<=69.9 ),'C', 
             np.where((data['Average'] >=50) & (data['Average'] <=59.9 ),'D',
             np.where((data['Average'] >=40) & (data['Average'] <=49.9 ),'E',
             np.where((data['Average'] >=0) & (data['Average'] <=39.9 ), 'U', 1))))))

In [8]:
print (data)

   id First_Name  Surname  Algebra  Calculus  Programming  Databases_  \
0   1        Joe     Soap       92        78           65          67
1   2       Jane      Doe       81        79           83          89
2   3       Mary  Poppins       63        52           65          71
3   4      Mario    Rossi       23        42           50          44
4   5       John    Smith       56        67           72          72
5   6        Tom     Cruz       81        62           53          59
6   7        Jim   Beglin       41        48           51          53
7   8      Peter  Shmooks       55        55           66          58
8   9       Hans    Meier       57        87           95          64
9  10     Jackie    Brown       97        91           86          73

   Average Grade
0     75.5     B
1     83.0     A
2     62.8     C
3     39.8     U
4     66.8     C
5     63.8     C
6     48.2     E
7     58.5     D
8     75.8     B
9     86.8     A

## Bonus Question:

In [9]:
import mysql.connector

In [10]:
## creating an instance of 'cursor' class which is used to execute the 'SQL' statements in 'Python'
cursor = conn.cursor()

#Create a separate table called 'Grades' under the 'college' database
cursor.execute("CREATE TABLE Grades (Firstname VARCHAR(50), Lastname VARCHAR(50), Grades VARCHAR(2))")

OperationalError: (1050, "Table 'grades' already exists")

In [ ]:
cursor.execute("SHOW TABLES") #There are 2 tables under the College database, this confirms the succesfull creation of the table' Grades'

In [ ]:
#Inserting data into the Grades table:

query= "INSERT INTO Grades (FirstName, Lastname, Grades) VALUES (%s, %s, %s)

In [ ]:
#Storing values:

values= [(" Joe", "Soap", "B"), 
         (" Jane", "Doe", "A"),
         ("Mary", "Poppins", "C"),
         ("Mario","Rossi", "U"),
         ("John", "Smith", "C"),
         ("Tom", "Cruz", "C"),
         ("Jim", "Beglin", "E"),
         ("Peter", "Shmooks", "D"),
         ("Hans", "Meier", "B"),
         ("Jackie", "Brown", "A")]

In [ ]:
## executing the query with values
cursor.executemany(query, values)

## to make final output:
conn.commit()

In [ ]:
### The rest of the file is from previous assignment instruction:

In [ ]:
#data.to_csv('output.csv', index=False)

In [ ]:
# Check if the output csv works:

In [ ]:
#df=pd.read_csv('output.csv') #Display the dataset 
#df.head()